app/controllers/tutorials_controller.rb

SELECT  `tutorials`.* FROM `tutorials` WHERE `tutorials`.`id` = 1 LIMIT 1
---
  def show
    Rails.logger.info("show tutorial")
    tutorial = Tutorial.find(params[:id])

INSERT INTO `tutorials` (`name`, `subject`, `author`) VALUES ('tutorial_1', 'Data Structures', 'Bhargavi')
---
  def create
    Rails.logger.info(tutorial_params)
    @tutorial = Tutorial.new(tutorial_params)
    if @tutorial.save